{"index":{"slug":"index","filePath":"index.md","title":"Welcome to the Soul Realms Wiki!","links":["World/Locations/Ars","Starnova-Studios","World/Characters/Rifters","Guides/Getting-Started","Guides/How-to-Join-Soul-Realms"],"tags":[],"content":"This is your gateway into the world of the Ars. This is where you can find the most up to date information on server features, our world, and more!\n🪴What is Soul Realms?\nSoul Realms is a vibrant, lore-rich Survival-RPG Minecraft server powered by Starnova Studios and lovingly maintained by its passionate player community. Designed for Minecraft versions 1.21 and up and compatible on both Java Edition &amp; Bedrock, it offers an expansive world brimming with custom mechanics, deep storylines, and endless exploration\n🔮 New Here?\nWelcome to the Ars, Rifter! Start with our Getting Started guide for a friendly guide to survival, progression, and getting your bearings in the Realms.\n❤️ I want to Join!\nWe’d love to have you! Full guides on how to join can be found in How to Join Soul Realms\n🎫 Need Help?\nHave a question or need to report something? We’re here to help! Reach out to us at our Official Discord and open a ticket or email us at support@soulrealms.net"},"Guides/Getting-Started":{"slug":"Guides/Getting-Started","filePath":"Guides/Getting Started.md","title":"Getting Started","links":[],"tags":["guides"],"content":"To-Do - Scribe Team"},"Guides/How-to-Join-Soul-Realms":{"slug":"Guides/How-to-Join-Soul-Realms","filePath":"Guides/How to Join Soul Realms.md","title":"How to Join","links":["Guides/Getting-Started"],"tags":["guides"],"content":"Ready to hop into the Ars? We’ve got you covered!\n☕ Java Edition\nJava Edition includes the PC Version of Minecraft. You can purchase it here\n\nLaunch Minecraft [We recommend playing on version 1.21.4!]\nOpen “Multiplayer”\nClick “Add Server”\nThe Server IP is play.soulrealms.net\nThe Server Name is up to you!\nAdd the Server and Join!\n\nYou’re in! If you want to learn more about how to play, read Getting Started\n🪨 Bedrock Edition\nJava Edition includes mobile, console, and tablet editions of Minecraft. You can purchase it here\n\nLaunch Minecraft\nClick the “Friends” button in the top right corner! (Minecraft has its’ own Friends System!)\nClick “Add Friends”\nType in SoulRealmsMC and add them!\nOnce they add you back (max ~1-2 seconds), click “Join Game!”\n\nYou’re in! If you want to learn more about how to play, read Getting Started\nNeed Help?\nHaving issues joining or are stuck on a step? We’re here to help! Reach out to us at our Official Discord and open a ticket."},"World/Characters/Rifters":{"slug":"World/Characters/Rifters","filePath":"World/Characters/Rifters.md","title":"Rifters","links":["The-Rift","World/Locations/The-Proxy","World/Locations/Ars","First-Hero","Second-Hero","Fallen-Hero","Crimson-Witch"],"tags":["life","characters"],"content":"\n\n                  \n                  The Heralds \n                  \n                \n\n\nRifters are outsiders, mistakes, abnormalities. Their existence is beyond the understanding of any person, monster, or even themselves. Exiles of The Rift with the only information on their origins as being from The Proxy.\n\n\n\nRifters are the name for players within the Ars. All players who join are considered Rifters, as their existence extends from beyond The Realm. However, not Rifters within the Ars have necessarily been players. Historically, the entrance of Rifters into the Realm is typically the sign of a great change, loss, or tensions within The Realm. They are harbingers of light, darkness, or both.\nThe effects of Rifters can be seen throughout the History of the Ars. It’s known that the First Hero, Second Hero, Fallen Hero, and Crimson Witch were all Rifters or were the child of them."},"World/Locations/Ars":{"slug":"World/Locations/Ars","filePath":"World/Locations/Ars.md","title":"Ars","links":["Soul-Realms","Nouveau","Veil-Market","N.O.V.A.","Emperors'-Castle"],"tags":["space","realm","dimension"],"content":"The Ars is the name of the realm in which all locations, worlds, characters, and history for Soul Realms’ survival record take place in.\nIt includes Nouveau, the Veil Market, N.O.V.A., the Emperors’ Castle, among hundreds of other important sites - past and present."},"World/Locations/The-Proxy":{"slug":"World/Locations/The-Proxy","filePath":"World/Locations/The Proxy.md","title":"The Proxy","links":["World/Miscellaneous/Beyond-the-Ars","World/Characters/Rifters","World/Locations/Ars"],"tags":["space","dimension"],"content":"The Proxy is a location Beyond the Ars. The only known information is that it is the origin point for all Rifters and their connection to the Ars flows through that dimension. Due to the memory wipe of Rifters once they enter the Ars, it is considered impossible to learn further information about this dimension."},"World/Miscellaneous/Beyond-the-Ars":{"slug":"World/Miscellaneous/Beyond-the-Ars","filePath":"World/Miscellaneous/Beyond the Ars.md","title":"Beyond the Ars","links":[],"tags":["space"],"content":"The term “Beyond the Ars” typically refers to locations that are unreachable due to being beyond the scope of the realm in any context. They are typically locations with little information known about them."}}