{"index":{"slug":"index","filePath":"index.md","title":"Welcome to the Soul Realms Wiki!","links":["World/Locations/Ars","World/Characters/Rifters","Getting-Started","World/World-Codex","How-to-Join-Soul-Realms"],"tags":[],"content":"This is your gateway into the world of the Ars. This is where you can find the most up to date information on server features, our world, and more!\n\n🪴What is Soul Realms?\nSoul Realms is a vibrant, lore-rich Survival-RPG Minecraft server built by Starnova Studios and lovingly maintained by its passionate player community. Designed for Minecraft versions 1.21 and up and compatible on both Java Edition &amp; Bedrock, it offers an expansive world brimming with custom mechanics, deep storylines, and endless exploration\n\n🔮 I’m new here!\nWelcome to the Ars, Rifter! If you’re new, we recommend reading the Getting Started guide. If you’re looking to learn about Soul Realms lore, take a look at the World Codex\n\n\n\n\n\n\n\n\n\n\n\n\n\nGetting StartedWorld CodexA guide on how to start playing and learning what there is to Soul RealmsAn introduction to the Ars, the lore, characters, and what makes the world what it is!\n❤️ I want to join!\nWe’d love to have you! Full guides on how to join can be found in How to Join Soul Realms\n\n🧭 Wiki Navigation\nThe Soul Realms Wiki is divided primarily into two sectors – the Server and the World.\nThe Server\nThe Server mainly contains information about playing Soul Realms, such as guides, feature information, and more! Its’ visible by default and has no separated folder.\nThe World\nThe World focuses on the Soul Realms world and backstory – it includes information about the History of the Ars, characters, entities, locations, and more! Its’ separated into its’ own “World” folder on the side.\nBoth of these regularly intersect, however, they are divided as the Server focuses on the gameplay aspect of Soul Realms while the World discusses the lore and history of the Ars\n\n🔧 Quick Links\nTODO - table by Scribe Team\n\n🎫 Need Help?\nHave a question or need to report something? We’re here to help! Reach out to us at our Official Discord and open a ticket or email us at support@soulrealms.net"},"Server/Guides/Getting-Started":{"slug":"Server/Guides/Getting-Started","filePath":"Server/Guides/Getting Started.md","title":"Getting Started","links":[],"tags":["guides"],"content":"To-Do - Scribe Team"},"Server/Guides/How-to-Join-Soul-Realms":{"slug":"Server/Guides/How-to-Join-Soul-Realms","filePath":"Server/Guides/How to Join Soul Realms.md","title":"How to Join","links":["Server/Guides/Getting-Started"],"tags":["guides"],"content":"Ready to hop into the Ars? We’ve got you covered!\n☕ Java Edition\nJava Edition includes the PC Version of Minecraft. You can purchase it here\n\nLaunch Minecraft [We recommend playing on version 1.21.4!]\nOpen “Multiplayer”\nClick “Add Server”\nThe Server IP is play.soulrealms.net\nThe Server Name is up to you!\nAdd the Server and Join!\n\nYou’re in! If you want to learn more about how to play, read Getting Started\n🪨 Bedrock Edition\nJava Edition includes mobile, console, and tablet editions of Minecraft. You can purchase it here\n\nLaunch Minecraft\nClick the “Friends” button in the top right corner! (Minecraft has its’ own Friends System!)\nClick “Add Friends”\nType in SoulRealmsMC and add them!\nOnce they add you back (max ~1-2 seconds), click “Join Game!”\n\nYou’re in! If you want to learn more about how to play, read Getting Started\nNeed Help?\nHaving issues joining or are stuck on a step? We’re here to help! Reach out to us at our Official Discord and open a ticket."},"World/Characters/Rifters":{"slug":"World/Characters/Rifters","filePath":"World/Characters/Rifters.md","title":"Rifters","links":["The-Rift","World/Locations/The-Proxy","World/Locations/Ars","First-Hero","Second-Hero","Fallen-Hero","Crimson-Witch","Vectorpoints","Rift-Energy","Arsborne","Scavenger-Tragedy","The-Emperor","Avians","Skills","Magic","Arts"],"tags":["life","characters","world"],"content":"\n\n                  \n                  The Heralds \n                  \n                \n\n\nRifters are outsiders, mistakes, abnormalities. Their existence is beyond the understanding of any person, monster, or even themselves. Exiles of The Rift with the only information on their origins as being from The Proxy.\n\n\n\nRifters are the name for players within the Ars. All players who join are considered Rifters, as their existence extends from beyond The Realm. However, not Rifters within the Ars have necessarily been players. Historically, the entrance of Rifters into the Realm is typically the sign of a great change, loss, or tensions within The Realm. They are harbingers of light, darkness, or both.\nThe effects of Rifters can be seen throughout the History of the Ars. It’s known that the First Hero, Second Hero, Fallen Hero, and Crimson Witch were all Rifters.\nGeneral Information\nRifters are exiles of The Rift, widely considered the most important and one of the three main Vectorpoints. They are thrown out of The Rift with no real way to predict when or why one appears. Upon exiting, they can be identified by the sheer level of Rift Energy they exert into the world around them.\nHistory\nThroughout history, the appearance of Rifters has typically coincided with a period of disarray, either occurring or forthcoming. It is widely considered a sign of The Rift detecting danger or rising tension that cannot be handled by the Arsborne alone.\nThere is no known written record that documents any one person as the “First Rifter,” however, much of history widely considered The First Hero to likely have been the beginning. Following the Scavenger Tragedy, The Crimson Witch was then documented to likely have been the first.\nRifters have been both praised and persecuted. Due to their ambiguity for being good or evil, there have been many notable cases of Rifters being killed by betrayal rather than in battle. However, The Emperor forbade Rifter Persecution in TODO DATE and no notable cases have risen since.\nRifter Memory Loss\nUpon entering the Ars, all known Rifters have seemingly lost all traces of memory. Various restoration attempts both magical and physical have been made, however, all have failed. This fact has led to very little to be known about where Rifters come from aside from their dimension of Origin.\nDimension of Origin\nIn TODO DATE, a group of Arsborne Researchers were directly working with The Rift during a magical experiment. During this work, a Rifter descended at the same time as a few of the scientists were directly next to the portal. This led to an extreme conflict of energy, leading to most of the researchers being sent rapidly backwards at incredible speeds. However, as most of the researchers were Avians, they survived the repulse damage.\nAll of them recalled a single message filling their heads upon the Rifters’ descension into the Ars, “The Proxy has rejected your connection.”\nUpon further experiments to confirm findings, this became widely regarded as the likely origin of where most Rifters came from. However, no other information beyond this has been able to be obtained.\nAbilities\nAll Rifters have access to Rapid Growth, an ability assumed to be sourced from their Rift Energy. This allows them to progress with Skills, Magic, and Arts at a much faster rate than most Arsborne. However, historically, there have been limits as to the level of power attainable by Rapid Growth from person to person.\nOrganizations\nThere are no known organizations comprised of solely of Rifters at this time."},"World/Entities/Ancient-Creatures":{"slug":"World/Entities/Ancient-Creatures","filePath":"World/Entities/Ancient Creatures.md","title":"Ancient Creatures","links":["World/Locations/Ars","corruption","World/Entities/Jrimp","The-First-Hero","The-Nether","The-Heralds","Art"],"tags":["life","ancient","group","world"],"content":"Ancient Creatures, otherwise known as the “Three Ancients,” were gargantuan beasts that formerly occupied the Ars. Their existence shaped the history, geography, and scientifical progress of the Ars. Only one of the creatures was fully slain while the others succumbed to corruption.\nCreatures\nThere were three total creatures that have been classified with the title of being an “Ancient Creature”\nJrimp\nThe Jrimp was an gargantuan shrimp that previously occupied the entire ocean seabed of the overworld. It had control over the rivers, most of the sea, and was considered the biggest obstacle to ocean exploration within the Ars. It was slain by The First Hero and remnants of its’ body occupy almost every sea creature within the Ars.\nLesth’oak\nLittle is known about this creature. Its’ existence was purged due to succumbing to corruption. Its’ name can be seen as one of the biggest obstacles in first entering The Nether in most written records. However, due to corruption, its’ sudden disappearance allowed for its’ exploration. There is no information on what it looks like or its’ abilities.\nThe title of Ancient Creature was granted by The Heralds at the same time as Drac’o Antiquus\nDrac’o Antiquus\nSimilar to lesth’oak, almost no information is known about Drac’o Antiquus beyond its’ name.\nHowever, despite the lack of information known about the creature itself, there is an incredible amount of people in history who had claimed to see the creature itself. Within most of these historical records, it is referred to a “creature resembling fear itself” – with almost no description beyond this.\nDue to this, wide assumption is that the creature has some form of a Psychological Art.\nAccording to The Heralds, the creature succumbed to corruption at effectively the same time as Lesth’oak, indicating the fall of both were likely connected.\nThe title of Ancient Creature was granted by The Heralds at the same time as Lesth’oak"},"World/Entities/Jrimp":{"slug":"World/Entities/Jrimp","filePath":"World/Entities/Jrimp.md","title":"Jrimp","links":["World/Entities/Ancient-Creatures","World/Locations/Ars","The-First-Hero","Border","Arsborne"],"tags":["life","ancient","world"],"content":"\n\n                  \n                  The First Hero \n                  \n                \n\n\nGargantuan. That’s the only word to describe it. It was a gargantuan sea creature that filled not just the ocean but every river in the realm.\n\n\n\nJrimp was one of the three Ancient Creatures that previously occupied the Ars. It was slain by The First Hero and the remnants of its’ body occupy every sea creature in the realm.\nAbilities\nThe Jrimp itself has no offensive nor defensive abilities or specialized attacks – its’ sheer size provided for its’ survival. Whenever a creature spawned, it simply used its’ tentacles to capture and consume it before it had even had the opportunity to consider escape.\nHistory\nAccording to The First Hero, the Jrimp was an ancient creatures thats’ body spanned across the entire ocean of the Ars. The exact size of the creature was unknown, however, it laid across the seabed floor and essentially consumed every sea creature that spawned out of the Ars. As part of The First Heros’ journey to the Border, the ocean was an uncrossable boundary. At the time, any form of boat would be sunk by the Jrimp for food. This sheer dominance over the sea floor led most Arsborne to be land-only and most Aquatic-folk to live within lakes to survive.\nThe lack of ability to explore beyond the sea led to The First Heros’ decision to slay the Jrimp. Information about the battle is undocumented – as the expeditition was taken solo. However, after its’ death, the body parts of the Jrimp spread across the ocean and effectively became a part of every sea-based organism.\nModern Day Effects\nUpon the slaying of the Jrimp, its’ body essentially became a component of the ocean itself. Every organism that spawns within the water contains some portion of the original ancient creatures’ body within itself at varying margins. This has led to certain organisms whose body cannot process or handle coinciding with the Jrimps’ body to become exceedingly rare and forced to live in lakes, lush caves, or in other dimensions."},"World/Miscellaneous/Beyond-the-Ars":{"slug":"World/Miscellaneous/Beyond-the-Ars","filePath":"World/Miscellaneous/Beyond the Ars.md","title":"Beyond the Ars","links":[],"tags":["space","world"],"content":"The term “Beyond the Ars” typically refers to locations that are unreachable due to being beyond the scope of the realm in any context. They are typically locations with little information known about them."},"World/Locations/Ars":{"slug":"World/Locations/Ars","filePath":"World/Locations/Ars.md","title":"Ars","links":["Soul-Realms","Nouveau","Veil-Market","N.O.V.A.","Emperors'-Castle"],"tags":["space","realm","dimension","world"],"content":"The Ars is the name of the realm in which all locations, worlds, characters, and history for Soul Realms’ survival record take place in.\nIt includes Nouveau, the Veil Market, N.O.V.A., the Emperors’ Castle, among hundreds of other important sites - past and present."},"World/Locations/The-Proxy":{"slug":"World/Locations/The-Proxy","filePath":"World/Locations/The Proxy.md","title":"The Proxy","links":["World/Miscellaneous/Beyond-the-Ars","World/Characters/Rifters","World/Locations/Ars"],"tags":["space","dimension","world"],"content":"The Proxy is a location Beyond the Ars. The only known information is that it is the origin point for all Rifters and their connection to the Ars flows through that dimension. Due to the memory wipe of Rifters once they enter the Ars, it is considered impossible to learn further information about this dimension."},"Guides/Getting-Started":{"slug":"Guides/Getting-Started","filePath":"Guides/Getting Started.md","title":"Getting Started","links":[],"tags":["guides","server"],"content":"To-Do - Scribe Team"},"Guides/How-to-Join-Soul-Realms":{"slug":"Guides/How-to-Join-Soul-Realms","filePath":"Guides/How to Join Soul Realms.md","title":"How to Join","links":["Getting-Started"],"tags":["guides","server"],"content":"Ready to hop into the Ars? We’ve got you covered!\n☕ Java Edition\nJava Edition includes the PC Version of Minecraft. You can purchase it here\n\nLaunch Minecraft [We recommend playing on version 1.21.4!]\nOpen “Multiplayer”\nClick “Add Server”\nThe Server IP is play.soulrealms.net\nThe Server Name is up to you!\nAdd the Server and Join!\n\nYou’re in! If you want to learn more about how to play, read Getting Started\n🪨 Bedrock Edition\nJava Edition includes mobile, console, and tablet editions of Minecraft. You can purchase it here\n\nLaunch Minecraft\nClick the “Friends” button in the top right corner! (Minecraft has its’ own Friends System!)\nClick “Add Friends”\nType in SoulRealmsMC and add them!\nOnce they add you back (max ~1-2 seconds), click “Join Game!”\n\nYou’re in! If you want to learn more about how to play, read Getting Started\nNeed Help?\nHaving issues joining or are stuck on a step? We’re here to help! Reach out to us at our Official Discord and open a ticket."},"World/World-Codex":{"slug":"World/World-Codex","filePath":"World/World Codex.md","title":"World Codex","links":[],"tags":["guides","world"],"content":"To-Do Scribe Team"}}